test_artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 19:43:31(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 19:43:32(-0300)

--------------------------------------
Metrics for period to: 19:43:40(-0300) (width: 1.366s)
--------------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1474/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 42
  median: ...................................................................... 10.1
  p95: ......................................................................... 18
  p99: ......................................................................... 30.3
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 151.1
  max: ......................................................................... 651.4
  median: ...................................................................... 550.1
  p95: ......................................................................... 645.6
  p99: ......................................................................... 645.6


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 19:43:34(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 1474/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 42
  median: ...................................................................... 10.1
  p95: ......................................................................... 18
  p99: ......................................................................... 30.3
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 151.1
  max: ......................................................................... 651.4
  median: ...................................................................... 550.1
  p95: ......................................................................... 645.6
  p99: ......................................................................... 645.6